app/views/compromissos/index.html.erb

SELECT "salas".* FROM "salas" WHERE "salas"."compromisso_id" = ? LIMIT 1  [["compromisso_id", 9]]
---
	<%= compromisso.end_date.strftime("%H:%M")%>
	<% @sala = Sala.find(compromisso.sala_id)%>