app/controllers/compromissos_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "compromissos".* FROM "compromissos"
---
  def index
    @user = User.find(current_user)
    @compromissos = Compromisso.all

SELECT "salas".* FROM "salas"
---
  def new
    @compromisso = Compromisso.new
    @salas = Sala.all

SELECT "compromissos".* FROM "compromissos" WHERE ((start_date <= '2016-07-01 01:14:00.000000') AND (end_date >= '2016-07-01 07:14:00.000000') AND (sala_id == 1))
SELECT "compromissos".* FROM "compromissos" ORDER BY "compromissos"."id" ASC LIMIT 1
SELECT "salas".* FROM "salas"
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "compromissos" ("created_at", "sala_id", "texto", "titulo", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 27 Jun 2016 22:12:27 UTC +00:00], ["sala_id", 1], ["texto", "dasdsaads"], ["titulo", "Aula 1"], ["updated_at", Mon, 27 Jun 2016 22:12:27 UTC +00:00], ["user_id", 2]]
---
  def create
    @compromisso = Compromisso.new(compromisso_params)
    # Verifica se existe algo agendado nessa data
    isAnyDate = Compromisso.where("(start_date <= ?) AND (end_date >= ?) AND (sala_id == ?)", @compromisso.start_date, @compromisso.end_date, @compromisso.sala_id)
    if(isAnyDate.length > 0)
      redirect_to new_compromisso_path, notice: 'Data ja existe.'
    else
      @compromisso.date = Date.today   # Atribui a data de hoje ao compromisso (usado apenas para controle no banco)
      @compromisso.user = User.find(current_user)  # Atribui o usuario da sessao ao usuario que criou o agendamento
        respond_to do |format|
          if @compromisso.save

DELETE FROM "compromissos" WHERE "compromissos"."id" = ?  [["id", 1]]
---
  def destroy
    @compromisso.destroy

SELECT "compromissos".* FROM "compromissos" WHERE "compromissos"."id" = ? LIMIT 1  [["id", "2"]]
---
    def set_compromisso
      @compromisso = Compromisso.find(params[:id])