app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("created_at", "email", "nome", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?)