app/views/layouts/_header.html.erb

      </ul>
      <% if User.find(current_user).super %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]